In [23]:
#Pandas for Data Analysis
#Import pandas
import pandas as pd

In [24]:
#Find working directory
import os
os.getcwd()

'C:\\Users\\sumnima'

In [25]:
#Read a CSV file
df1 = pd.read_csv('grades.csv')

In [26]:
#View the first 10 rows of df1
print(df1.head(10))

   ID                 Name   GPA              Major
0  23            Rose Rios  3.97          Economics
1  55            Ian Brown  1.44  Political Science
2  54         Stanley Dean  3.75         Philosophy
3  19  Stephanie Henderson  1.86        Mathematics
4  81          Angela Mora  3.86            Physics
5  60          Mark Martin  1.47          Chemistry
6  47     Jennifer Perkins  2.88            English
7  11      William Stewart  1.27            Biology
8  34           Eric Moore  3.40            Spanish
9  70      Kenneth Rollins  2.37                Art

In [27]:
#View the bottom 10 rows of df1
print(df1.tail(10))

     ID                 Name   GPA        Major
94   20          Diane Brown  1.73  Mathematics
95   41     Brenda Valentine  3.10      Physics
96   86        Grace Hoffman  1.30    Chemistry
97   10          Joshua Ware  3.29      English
98   61  Ms. Samantha Steele  2.56      Spanish
99   22            Lisa Chen  1.45          Art
100  96         Jamie Knight  1.65     Business
101  95       Karen Williams  1.16     Business
102  80   Carrie Trujillo MD  1.44      Theatre
103  58         Renee Austin  2.60     Business

In [28]:
#Summary Statistics
df1.describe()

               ID         GPA
count  104.000000  104.000000
mean    51.721154    2.447115
std     29.253979    0.827750
min      1.000000    1.030000
25%     26.750000    1.657500
50%     52.500000    2.465000
75%     77.250000    3.132500
max    100.000000    3.970000

In [29]:
#Check for duplicate rows
duplicate_count = df1.duplicated().sum()
print(duplicate_count)

#duplicates = df1. duplicated()
#print(duplicates)

#View instances of the duplicated rows
duplicated_rows = df1[df1.duplicated()]
duplicated_rows

4

     ID                Name   GPA     Major
100  96        Jamie Knight  1.65  Business
101  95      Karen Williams  1.16  Business
102  80  Carrie Trujillo MD  1.44   Theatre
103  58        Renee Austin  2.60  Business

In [30]:
#Drop duplicate rows
df1.drop_duplicates(inplace=True)

In [31]:
#Count missing values and drop rows with missing values
print(df1.isnull().sum())

df1.dropna(inplace=True) # "inplace=True" modifies the existing data frame
print(df1.isnull().sum())

ID       0
Name     0
GPA      0
Major    0
dtype: int64
ID       0
Name     0
GPA      0
Major    0
dtype: int64

In [32]:
#Creating a new column "honour" 
def h_gpa(x):
    if x>3.5:
        return 'Yes'
    else:
        return 'No'
df1['Honour Student']= df1['GPA'].map(h_gpa)
df1

    ID                 Name   GPA              Major Honour Student
0   23            Rose Rios  3.97          Economics            Yes
1   55            Ian Brown  1.44  Political Science             No
2   54         Stanley Dean  3.75         Philosophy            Yes
3   19  Stephanie Henderson  1.86        Mathematics             No
4   81          Angela Mora  3.86            Physics            Yes
..  ..                  ...   ...                ...            ...
95  41     Brenda Valentine  3.10            Physics             No
96  86        Grace Hoffman  1.30          Chemistry             No
97  10          Joshua Ware  3.29            English             No
98  61  Ms. Samantha Steele  2.56            Spanish             No
99  22            Lisa Chen  1.45                Art             No

[100 rows x 5 columns]

In [33]:
#Read Excel File
df2 = pd.read_excel('tuition.xlsx')

In [34]:
#Count missing values and drop rows with missing values
print(df2.isnull().sum())

df2.dropna(inplace=True) #"inplace=True" modifies the existing data frame
print(df2.isnull().sum())

ID                0
Name              0
State Resident    2
Tuition           2
Financial Aid     0
dtype: int64
ID                0
Name              0
State Resident    0
Tuition           0
Financial Aid     0
dtype: int64

In [35]:
#Check for duplicate rows
duplicate_count = df2.duplicated().sum()
print(duplicate_count)

#duplicates = df2.duplicated()
#print(duplicates)

#View instances of the duplicated rows
duplicated_rows = df2[df2.duplicated()]
duplicated_rows

1

     ID        Name State Resident  Tuition  Financial Aid
100   4  Eric Ellis             No  30000.0          12978

In [36]:
#Drop duplicate rows
df2.drop_duplicates(inplace=True)

In [37]:
#Map with a function
df2['Cost'] = df2['Tuition']- df2['Financial Aid']

#Display the Cost
print(df2)

    ID                 Name State Resident  Tuition  Financial Aid     Cost
0   17      Alexandra Green            Yes  20000.0           5180  14820.0
1   18      Alexandra Green             No  30000.0           7087  22913.0
2   81          Angela Mora            Yes  20000.0          12031   7969.0
3   57    Angela Oneill DDS            Yes  20000.0           7064  12936.0
4    2     Anthony Martinez            Yes  20000.0           6479  13521.0
..  ..                  ...            ...      ...            ...      ...
95  90  Stephanie Stevenson            Yes  20000.0          13431   6569.0
96  42         Summer Baker            Yes  20000.0          12094   7906.0
97  43          Tamara Lowe            Yes  20000.0           5761  14239.0
98  78     William Caldwell             No  30000.0          10663  19337.0
99  11      William Stewart            Yes  20000.0           9349  10651.0

[98 rows x 6 columns]

In [38]:
#Mering data frames using Inner Join on the 'ID' column

df3 = pd.merge(df1, df2, on='ID', how='inner')
print(df3)

    ID               Name_x   GPA              Major Honour Student  \
0   23            Rose Rios  3.97          Economics            Yes
1   55            Ian Brown  1.44  Political Science             No
2   54         Stanley Dean  3.75         Philosophy            Yes
3   81          Angela Mora  3.86            Physics            Yes
4   60          Mark Martin  1.47          Chemistry             No
..  ..                  ...   ...                ...            ...
93  41     Brenda Valentine  3.10            Physics             No
94  86        Grace Hoffman  1.30          Chemistry             No
95  10          Joshua Ware  3.29            English             No
96  61  Ms. Samantha Steele  2.56            Spanish             No
97  22            Lisa Chen  1.45                Art             No

                 Name_y State Resident  Tuition  Financial Aid     Cost
0             Rose Rios            Yes  20000.0          11038   8962.0
1             Ian Brown            Yes  20000.0           6977  13023.0
2          Stanley Dean            Yes  20000.0          11481   8519.0
3           Angela Mora            Yes  20000.0          12031   7969.0
4           Mark Martin            Yes  20000.0          12477   7523.0
..                  ...            ...      ...            ...      ...
93     Brenda Valentine             No  30000.0           9915  20085.0
94        Grace Hoffman             No  30000.0          12102  17898.0
95          Joshua Ware             No  30000.0          11174  18826.0
96  Ms. Samantha Steele             No  30000.0          13103  16897.0
97            Lisa Chen             No  30000.0           9901  20099.0

[98 rows x 10 columns]

In [39]:
#Count missing values and drop rows with missing values
print(df3.isnull().sum())

df3.dropna(inplace=True) # 'inplace=True' modifies the existing the data frame
print(df3.isnull().sum())

ID                0
Name_x            0
GPA               0
Major             0
Honour Student    0
Name_y            0
State Resident    0
Tuition           0
Financial Aid     0
Cost              0
dtype: int64
ID                0
Name_x            0
GPA               0
Major             0
Honour Student    0
Name_y            0
State Resident    0
Tuition           0
Financial Aid     0
Cost              0
dtype: int64

In [40]:
#Group the students by major and display the mean GPA 
df_major = df3.groupby('Major')
df_major['GPA']
print(df_major['GPA'].mean())

Major
Art                  2.760000
Biology              2.586667
Business             2.051667
Chemistry            2.652000
Economics            3.970000
English              2.658000
History              2.567273
Mathematics          1.640000
Philosophy           2.701667
Physics              2.345000
Political Science    1.440000
Spanish              2.258333
Theatre              2.322857
Name: GPA, dtype: float64

In [41]:
#Display net cost by major
df_major['Cost']

df_major['Cost'].mean()

Major
Art                  11472.125000
Biology              13674.111111
Business             12010.666667
Chemistry            13750.800000
Economics             8962.000000
English              12958.000000
History              11793.636364
Mathematics          14377.600000
Philosophy           13188.333333
Physics              13250.750000
Political Science    13023.000000
Spanish              10735.000000
Theatre              11180.714286
Name: Cost, dtype: float64

In [42]:
#Filtering everyone with less than 2.3 GPA from df3
df_filter = df3[df3['GPA'] > 2.3]
print(df_filter)

     ID                Name_x   GPA       Major Honour Student  \
0    23             Rose Rios  3.97   Economics            Yes
2    54          Stanley Dean  3.75  Philosophy            Yes
3    81           Angela Mora  3.86     Physics            Yes
5    47      Jennifer Perkins  2.88     English             No
7    34            Eric Moore  3.40     Spanish             No
8    70       Kenneth Rollins  2.37         Art             No
9    33       Robert Gonzalez  3.63     History            Yes
10   98        Donald Blevins  3.52     Theatre            Yes
11   14        Rachel Salinas  2.70    Business             No
12   35          Sandra Jones  3.57   Chemistry            Yes
14   43           Tamara Lowe  2.65     Biology             No
15   57     Angela Oneill DDS  2.58     Spanish             No
16   16          Kari Estrada  3.75         Art            Yes
21   82          Peter Hansen  2.94   Chemistry             No
22   62        Kimberly Brown  3.70     English            Yes
23   45         Chase Sanders  3.11     Biology             No
24   79            Jill Lopez  2.75     Spanish             No
25   94        Michael Miller  3.91         Art            Yes
26   36           Jose Barnes  3.33     History             No
29   77       Robert Davidson  3.26   Chemistry             No
31   75  Christopher Garrison  3.32     Biology             No
33   37         Renee Marquez  3.65         Art            Yes
34   50        Luis Stevenson  3.72         Art            Yes
35   48         Melissa Lewis  3.61     History            Yes
36   24           Mark Hester  2.52     Theatre             No
38   40        Brittany Jones  3.18   Chemistry             No
40   27           Kristy Gray  3.36     Biology             No
42   51         James Tran MD  2.53         Art             No
43   66     Christina Osborne  3.11     History             No
47   76            John Young  3.47   Chemistry             No
48   31        Kimberly Hayes  2.70     English             No
49    1          Nicole Allen  3.17     Biology             No
55   42          Summer Baker  2.51     Spanish             No
58   68            Lisa Lewis  3.08  Philosophy             No
61    5        Chelsea Flores  3.01   Chemistry             No
64   46         Daniel Benson  3.75     Spanish            Yes
65   99  Mrs. Mary Sampson MD  3.43         Art             No
68   58          Renee Austin  2.60    Business             No
69   67         Jennifer Bray  2.48   Chemistry             No
70   52       Melissa Hancock  2.79     English             No
74   13           David Ortiz  3.04         Art             No
75    2      Anthony Martinez  2.86     History             No
76   32         Joshua Hughes  3.42  Philosophy             No
78  100    Lawrence Rodriguez  2.66     Theatre             No
79   56            John Moore  2.35    Business             No
81   63            Mark Hines  3.34     English             No
85   92          John Ramirez  3.75         Art            Yes
86   17       Alexandra Green  2.46     History             No
87    6          Karen Carson  2.47     Theatre             No
89   18       Alexandra Green  3.12         Art             No
91   78      William Caldwell  2.79  Philosophy             No
93   41      Brenda Valentine  3.10     Physics             No
95   10           Joshua Ware  3.29     English             No
96   61   Ms. Samantha Steele  2.56     Spanish             No

                  Name_y State Resident  Tuition  Financial Aid     Cost
0              Rose Rios            Yes  20000.0          11038   8962.0
2           Stanley Dean            Yes  20000.0          11481   8519.0
3            Angela Mora            Yes  20000.0          12031   7969.0
5       Jennifer Perkins            Yes  20000.0          14608   5392.0
7             Eric Moore            Yes  20000.0          10785   9215.0
8        Kenneth Rollins            Yes  20000.0           9461  10539.0
9        Robert Gonzalez            Yes  20000.0          12805   7195.0
10        Donald Blevins            Yes  20000.0          12147   7853.0
11        Rachel Salinas            Yes  20000.0          11405   8595.0
12          Sandra Jones            Yes  20000.0          12543   7457.0
14           Tamara Lowe            Yes  20000.0           5761  14239.0
15     Angela Oneill DDS            Yes  20000.0           7064  12936.0
16          Kari Estrada            Yes  20000.0          12814   7186.0
21          Peter Hansen             No  30000.0           7489  22511.0
22        Kimberly Brown             No  30000.0          12401  17599.0
23         Chase Sanders             No  30000.0           5594  24406.0
24            Jill Lopez             No  30000.0          10873  19127.0
25        Michael Miller             No  30000.0          13234  16766.0
26           Jose Barnes             No  30000.0          13846  16154.0
29       Robert Davidson             No  30000.0           8210  21790.0
31  Christopher Garrison             No  30000.0          12956  17044.0
33         Renee Marquez            Yes  20000.0          11019   8981.0
34        Luis Stevenson            Yes  20000.0          11464   8536.0
35         Melissa Lewis            Yes  20000.0          11571   8429.0
36           Mark Hester            Yes  20000.0           8671  11329.0
38        Brittany Jones            Yes  20000.0          14916   5084.0
40           Kristy Gray            Yes  20000.0           5200  14800.0
42         James Tran MD            Yes  20000.0           5369  14631.0
43     Christina Osborne            Yes  20000.0           7542  12458.0
47            John Young             No  30000.0           9403  20597.0
48        Kimberly Hayes             No  30000.0          10327  19673.0
49          Nicole Allen            Yes  20000.0           9677  10323.0
55          Summer Baker            Yes  20000.0          12094   7906.0
58            Lisa Lewis            Yes  20000.0          10445   9555.0
61        Chelsea Flores            Yes  20000.0           9534  10466.0
64         Daniel Benson            Yes  20000.0           8995  11005.0
65  Mrs. Mary Sampson MD            Yes  20000.0           8653  11347.0
68          Renee Austin            Yes  20000.0           9818  10182.0
69         Jennifer Bray            Yes  20000.0           6742  13258.0
70       Melissa Hancock            Yes  20000.0          11960   8040.0
74           David Ortiz            Yes  20000.0          14902   5098.0
75      Anthony Martinez            Yes  20000.0           6479  13521.0
76         Joshua Hughes            Yes  20000.0          10176   9824.0
78    Lawrence Rodriguez            Yes  20000.0          13674   6326.0
79            John Moore            Yes  20000.0           8745  11255.0
81            Mark Hines            Yes  20000.0          14912   5088.0
85          John Ramirez            Yes  20000.0           7133  12867.0
86       Alexandra Green            Yes  20000.0           5180  14820.0
87          Karen Carson            Yes  20000.0          10260   9740.0
89       Alexandra Green             No  30000.0           7087  22913.0
91      William Caldwell             No  30000.0          10663  19337.0
93      Brenda Valentine             No  30000.0           9915  20085.0
95           Joshua Ware             No  30000.0          11174  18826.0
96   Ms. Samantha Steele             No  30000.0          13103  16897.0

In [44]:
#Sorting ID by descending order
df_desc = df3.sort_values('ID', ascending= False)
print(df_desc)

     ID                Name_x   GPA        Major Honour Student  \
78  100    Lawrence Rodriguez  2.66      Theatre             No
65   99  Mrs. Mary Sampson MD  3.43          Art             No
10   98        Donald Blevins  3.52      Theatre            Yes
72   97          Linda Dalton  1.30      Spanish             No
28   96          Jamie Knight  1.65     Business             No
..  ...                   ...   ...          ...            ...
61    5        Chelsea Flores  3.01    Chemistry             No
45    4            Eric Ellis  1.20  Mathematics             No
37    3         Shawn Gilbert  1.85     Business             No
75    2      Anthony Martinez  2.86      History             No
49    1          Nicole Allen  3.17      Biology             No

                  Name_y State Resident  Tuition  Financial Aid     Cost
78    Lawrence Rodriguez            Yes  20000.0          13674   6326.0
65  Mrs. Mary Sampson MD            Yes  20000.0           8653  11347.0
10        Donald Blevins            Yes  20000.0          12147   7853.0
72          Linda Dalton            Yes  20000.0          11388   8612.0
28          Jamie Knight             No  30000.0           9843  20157.0
..                   ...            ...      ...            ...      ...
61        Chelsea Flores            Yes  20000.0           9534  10466.0
45            Eric Ellis             No  30000.0          12978  17022.0
37         Shawn Gilbert            Yes  20000.0          14750   5250.0
75      Anthony Martinez            Yes  20000.0           6479  13521.0
49          Nicole Allen            Yes  20000.0           9677  10323.0

[98 rows x 10 columns]

In [45]:
#Exporting df3 as a CSV 
df3.to_csv('output.csv',index= False)

In [46]:
#Exporting df3 as an excel file
df3.to_excel('output.xlsx', index= False)